app/Controllers/News.php

SELECT *
FROM `news`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = model(NewsModel::class);
        helper(['form', 'url', 'text']);

        $data = [
            'news'  => $model->orderBy('id', 'DESC')->findAll(),
            'title' => 'समाचार संग्रह - नेपाल न्यूज एक्सप्रेस',
        ];